In [2]:
import pymysql
import pandas as pd

In [2]:
conn=pymysql.connect(host='localhost',port=3306,user='root',password='deeraj',db='dimention')

In [3]:
s=pd.read_sql_query('select * from employees',conn)
s

  FIRST_NAME LAST_NAME  AGE SEX  INCOME
0        Mac     Mohan   20   M  2000.0
1        Mac     Mohan   20   M  2000.0
2        Mac     Mohan   20   M  2000.0
3        Mac    ganesh   21   M  1999.0
4        Mac     Mohan   20   M  2000.0

In [43]:
cursor=conn.cursor()

In [27]:
cursor.execute('create table hi(name varchar(10))')

0

In [49]:
cursor.execute("insert into hi values('taru')")

1

In [52]:
cursor.execute('select * from hi')
for i in cursor:
    print(i)

In [36]:
cursor.close()
conn.close()

In [51]:
conn.rollback()

In [37]:
print(cursor)

<pymysql.cursors.Cursor object at 0x000002702655EE80>

In [4]:
bank_data=pd.read_sql_query('select * from bank_validation',conn)

In [6]:
print(bank_data)

   BankID    AccountID
0   A1020    S39403030
1   A1020    S30495345
2   A1020   S234234432
3   A1020    C34534543
4   A1020    C34595044
5   A1020  C2304985345
6   A1020   D934530945
7   A1020   D940404984
8   A1020   D02340494r
9   A1021  S3405935845
10  A1021   S950504840
11  A1021    S94040958
12  A1021    C34095345
13  A1021    C08548494
14  A1021    C88594048
15  A1021     D9440021
16  A1021     D4954896

In [5]:
bank_data.info()
print("-----"*10)
print(bank_data.shape)
print("-----"*10)
print(bank_data.size)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   BankID     17 non-null     object
 1   AccountID  17 non-null     object
dtypes: object(2)
memory usage: 400.0+ bytes
--------------------------------------------------
(17, 2)
--------------------------------------------------
34

In [24]:
print(bank_data)

   BankID    AccountID  len
0   A1020    S39403030    9
1   A1020    S30495345    9
2   A1020   S234234432   10
3   A1020    C34534543    9
4   A1020    C34595044    9
5   A1020  C2304985345   11
6   A1020   D934530945   10
7   A1020   D940404984   10
8   A1020   D02340494r   10
9   A1021  S3405935845   11
10  A1021   S950504840   10
11  A1021    S94040958    9
12  A1021    C34095345    9
13  A1021    C08548494    9
14  A1021    C88594048    9
15  A1021     D9440021    8
16  A1021     D4954896    8

In [16]:
bank_data['len']=bank_data['AccountID'].str.len()

In [20]:
for i,j,k in zip(bank_data['BankID'],bank_data['AccountID'],bank_data['len']):
    if k<9:
        print(i,j,k)

A1021 D9440021 8
A1021 D4954896 8

In [25]:
bank_data[['BankID','AccountID']].drop_duplicates()

   BankID    AccountID
0   A1020    S39403030
1   A1020    S30495345
2   A1020   S234234432
3   A1020    C34534543
4   A1020    C34595044
5   A1020  C2304985345
6   A1020   D934530945
7   A1020   D940404984
8   A1020   D02340494r
9   A1021  S3405935845
10  A1021   S950504840
11  A1021    S94040958
12  A1021    C34095345
13  A1021    C08548494
14  A1021    C88594048
15  A1021     D9440021
16  A1021     D4954896

In [26]:
bank_data['AccountID'].duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
Name: AccountID, dtype: bool

In [126]:
data=pd.read_excel(r'C:\Users\ELCOT\OneDrive\Documents\B validation.xlsx')
data

   BankId    AccountID
0   A1020    S39403030
1   A1020    S30495345
2   A1020   S234234432
3   A1020    C34534543
4   A1020    C34595044
5   A1020  C2304985345
6   A1020   D934530945
7   A1020   D940404984
8   A1020   D02340494r
9   A1021  S3405935845
10  A1021   S950504840
11  A1021    S94040958
12  A1021    C34095345
13  A1021    C08548494
14  A1021    C88594048
15  A1021     D9440021
16  A1021     D9440021
17  A1021      D495489

In [127]:
data['Account_type']=data['AccountID'].astype(str).str[:1]
data['len_id']=data['AccountID'].astype(str).str.len()
data['c']=data['BankId']+data['AccountID']
print(data)

   BankId    AccountID Account_type  len_id                 c
0   A1020    S39403030            S       9    A1020S39403030
1   A1020    S30495345            S       9    A1020S30495345
2   A1020   S234234432            S      10   A1020S234234432
3   A1020    C34534543            C       9    A1020C34534543
4   A1020    C34595044            C       9    A1020C34595044
5   A1020  C2304985345            C      11  A1020C2304985345
6   A1020   D934530945            D      10   A1020D934530945
7   A1020   D940404984            D      10   A1020D940404984
8   A1020   D02340494r            D      10   A1020D02340494r
9   A1021  S3405935845            S      11  A1021S3405935845
10  A1021   S950504840            S      10   A1021S950504840
11  A1021    S94040958            S       9    A1021S94040958
12  A1021    C34095345            C       9    A1021C34095345
13  A1021    C08548494            C       9    A1021C08548494
14  A1021    C88594048            C       9    A1021C88594048
15  A1021     D9440021            D       8     A1021D9440021
16  A1021     D9440021            D       8     A1021D9440021
17  A1021      D495489            D       7      A1021D495489

In [104]:
print(data['AccountID'][data['AccountID'].astype(str).str[1:].str.isdigit()==False])

8    D02340494r
Name: AccountID, dtype: object

In [118]:
#first step cleaning
data.drop(data['AccountID'][data['AccountID'].astype(str).str[1:].\
                            str.isdigit()==False].index,inplace=True)
data['n_in']=range(0,len(data))

In [151]:
#error
e1=data[['AccountID','BankId']][data['AccountID'].astype(str).str[1:].\
                            str.isdigit()==False]
e1['reason']='contain int'
print(e1)

    AccountID BankId       reason
8  D02340494r  A1020  contain int

In [119]:

#print(data)
data.dropna(inplace=True)
#data=data.set_index('n_in')
non_int=pd.DataFrame(data)
non_int

   BankId    AccountID  n_in
0   A1020    S39403030     0
1   A1020    S30495345     1
2   A1020   S234234432     2
3   A1020    C34534543     3
4   A1020    C34595044     4
5   A1020  C2304985345     5
6   A1020   D934530945     6
7   A1020   D940404984     7
9   A1021  S3405935845     8
10  A1021   S950504840     9
11  A1021    S94040958    10
12  A1021    C34095345    11
13  A1021    C08548494    12
14  A1021    C88594048    13
15  A1021     D9440021    14
16  A1021     D9440021    15
17  A1021      D495489    16

In [113]:
#second strp cleaning
non_int.drop_duplicates(subset=['BankId','AccountID'],inplace=True)
print(non_int)
print('----------')
d=non_int
d

   BankId    AccountID Account_type  len_id                 c  n_in
0   A1020    S39403030            S       9    A1020S39403030     0
1   A1020    S30495345            S       9    A1020S30495345     1
2   A1020   S234234432            S      10   A1020S234234432     2
3   A1020    C34534543            C       9    A1020C34534543     3
4   A1020    C34595044            C       9    A1020C34595044     4
5   A1020  C2304985345            C      11  A1020C2304985345     5
6   A1020   D934530945            D      10   A1020D934530945     6
7   A1020   D940404984            D      10   A1020D940404984     7
9   A1021  S3405935845            S      11  A1021S3405935845     8
10  A1021   S950504840            S      10   A1021S950504840     9
11  A1021    S94040958            S       9    A1021S94040958    10
12  A1021    C34095345            C       9    A1021C34095345    11
13  A1021    C08548494            C       9    A1021C08548494    12
14  A1021    C88594048            C       9    A1021C88594048    13
15  A1021     D9440021            D       8     A1021D9440021    14
17  A1021      D495489            D       7      A1021D495489    16
----------

   BankId    AccountID Account_type  len_id                 c  n_in
0   A1020    S39403030            S       9    A1020S39403030     0
1   A1020    S30495345            S       9    A1020S30495345     1
2   A1020   S234234432            S      10   A1020S234234432     2
3   A1020    C34534543            C       9    A1020C34534543     3
4   A1020    C34595044            C       9    A1020C34595044     4
5   A1020  C2304985345            C      11  A1020C2304985345     5
6   A1020   D934530945            D      10   A1020D934530945     6
7   A1020   D940404984            D      10   A1020D940404984     7
9   A1021  S3405935845            S      11  A1021S3405935845     8
10  A1021   S950504840            S      10   A1021S950504840     9
11  A1021    S94040958            S       9    A1021S94040958    10
12  A1021    C34095345            C       9    A1021C34095345    11
13  A1021    C08548494            C       9    A1021C08548494    12
14  A1021    C88594048            C       9    A1021C88594048    13
15  A1021     D9440021            D       8     A1021D9440021    14
17  A1021      D495489            D       7      A1021D495489    16

In [153]:
#e2
n=non_int[non_int[['BankId','AccountID']].duplicated()]
e2=n[['BankId','AccountID']]
e2['reason']='duplicated'
e2

   BankId AccountID      reason
16  A1021  D9440021  duplicated

In [129]:
L=d[['AccountID','BankId','Account_type']][d['AccountID'].astype(str).str.len()>8]

In [154]:
e3=d[['AccountID','BankId']][d['AccountID'].astype(str).str.len()<8]
e3['reason']='length'
e3

   AccountID BankId  reason
17   D495489  A1021  length

In [86]:
#uploading into target
target_account=pd.DataFrame(columns={'AccountID','BankId','Account_type'})
target_account=target_account.append(L,ignore_index=True)
print(target_account)

   Account_type    AccountID BankId
0             S    S39403030  A1020
1             S    S30495345  A1020
2             S   S234234432  A1020
3             C    C34534543  A1020
4             C    C34595044  A1020
5             C  C2304985345  A1020
6             D   D934530945  A1020
7             D   D940404984  A1020
8             S  S3405935845  A1021
9             S   S950504840  A1021
10            S    S94040958  A1021
11            C    C34095345  A1021
12            C    C08548494  A1021
13            C    C88594048  A1021

In [187]:
err=pd.concat([e1,e2,e3])
s=range(1,4)#df.insert(2, 'new-col', data)
err.insert(0,'seq',s)
r=err['AccountID']+err['BankId']
err.insert(3,'record',r)
err

    seq   AccountID BankId           record       reason
8     1  D02340494r  A1020  D02340494rA1020  contain int
16    2    D9440021  A1021    D9440021A1021   duplicated
17    3     D495489  A1021     D495489A1021       length

In [183]:
seq=range(1,4)
err=pd.DataFrame(index=seq)
err=pd.concat([e1,e2,e3])
print(err)

     AccountID BankId       reason
8   D02340494r  A1020  contain int
16    D9440021  A1021   duplicated
17     D495489  A1021       length

In [167]:
err['AccountID']+err['BankId']

8     D02340494rA1020
16      D9440021A1021
17       D495489A1021
dtype: object

In [98]:
a=[]
for i in data['Account_type']:
    if i.lower() not in('s'):
        if i not in a:
            a.append(i)
for j in range(len(a)):
    p=data[data['Account_type']==a[j]]
    print(p)

   BankId    AccountID Account_type  len_id                 c
3   A1020    C34534543            C       9    A1020C34534543
4   A1020    C34595044            C       9    A1020C34595044
5   A1020  C2304985345            C      11  A1020C2304985345
12  A1021    C34095345            C       9    A1021C34095345
13  A1021    C08548494            C       9    A1021C08548494
14  A1021    C88594048            C       9    A1021C88594048
   BankId   AccountID Account_type  len_id                c
6   A1020  D934530945            D      10  A1020D934530945
7   A1020  D940404984            D      10  A1020D940404984
8   A1020  D02340494r            D      10  A1020D02340494r
15  A1021    D9440021            D       8    A1021D9440021
16  A1021    D9440021            D       8    A1021D9440021
17  A1021     D495489            D       7     A1021D495489

In [1]:
a=3
while a>0:
    print('hi')
    a-=1

hi
hi
hi

In [14]:
from pandas import DataFrame

boxes = {'Color': ['Green','Green','Green','Blue','Blue','Red','Red','Red'],
         'Shape': ['Rectangle','Rectangle','Square','Rectangle','Square','Square','Square','Rectangle'],
         'Price': [10,15,5,5,10,15,15,5]
        }

df = DataFrame(boxes, columns= ['Color','Shape','Price'])

select_color = df.loc[df['Color'] == 'Green']
print (select_color)

   Color      Shape  Price
0  Green  Rectangle     10
1  Green  Rectangle     15
2  Green     Square      5

In [ ]:
import numpy as np
c=data[['BankId','AccountID',]]
np.unique(c)